000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПаролиДиректоров/ПаролиДиректоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаролиДиректоров</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/CommonForms/ФормаСменыПароляДиректора/Module.bsl
&НаСервере
Процедура СменитьПароль(Пароль)
		НаборЗаписей = РегистрыСведений.ПаролиДиректоров.СоздатьНаборЗаписей(); 
		Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;
		НаборЗаписей.Отбор.Магазин.Установить(Магазин);
        НаборЗаписей.Записать();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Магазин = Магазин;
		НоваяЗапись.Пароль = Пароль;

		НаборЗаписей.Записать();	

	
КонецПроцедуры


&НаКлиенте
Процедура Сменить(Команда)
	Если Пароль = "" тогда 
		ПоказатьПредупреждение(,"Заполните пароль!",5,"Проверьте пароль и подтверждение пароля!");
	Иначе
		Если НЕ Пароль =  ПодтверждениеПароля тогда
			ПоказатьПредупреждение(,"Пароли не совпадают!",5,"Проверьте пароль и подтверждение пароля!");
			Возврат;
		Иначе 
			СменитьПароль(Пароль);
			ПоказатьОповещениеПользователя("Пароль изменен!",,,,,);
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
